1s/ERP/Conf/Catalogs/Лико_КонтрольПартийПоризводстваНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_КонтрольПартийПоризводстваНоменклатуры</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Выключить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СложнаяНастройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборНастройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Исключить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_ПартииПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_ПартииПроизводства</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПартияОбъектНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЯССМ_ОбъектыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерияОбъектНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЯССМ_ОбъектыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПартииИзготовления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УпотребитьДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_КонтрольПартийПоризводстваНоменклатуры/Ext/ManagerModule.bsl
Функция Старт()  Экспорт //+Лико m.shenderov 29.03.2023
	ДатаНачалаКонтроляПартииПроизводстваТовара=Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаКонтроляПартииПроизводстваТовара.ЗначениеПараметра;
	
	Если ЗначениеЗаполнено(ДатаНачалаКонтроляПартииПроизводстваТовара) И ДатаНачалаКонтроляПартииПроизводстваТовара< ТекущаяДата() Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь; 
	
КонецФункции //-Лико m.shenderov 29.03.2023 

Функция ЕстьКонтроль(Номенклатура,ДокументРасхода=Неопределено) Экспорт
	
	ЕстьКонтроль=Ложь;	
	Запрос = Новый Запрос;
	Запрос.Текст=ТекстЗапросаПравилПоВидуНоменклатуры(); 
	Запрос.УстановитьПараметр("ВидНоменклатуры",Номенклатура.ВидНоменклатуры );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл 		
		ИспользоватьЭтоПравило=Истина;	
		Если Выборка.СложнаяНастройка Тогда 
		ИспользоватьЭтоПравило= ИспользоватьПравилоСКД(Выборка,Номенклатура,Истина);		
			
		Иначе
			Для каждого ДопРеквизит Из Выборка.Ссылка.ДополнительныеРеквизиты Цикл			
				Если ЗначениеЗаполнено(ДопРеквизит.Значение) ТОгда
					Структура = Новый Структура;
					Структура.Вставить("Свойство",ДопРеквизит.Свойство);
					Структура.Вставить("Значение",ДопРеквизит.Значение);
					НайденоСвойство=Номенклатура.ДополнительныеРеквизиты.НайтиСтроки(Структура).Количество()>0;
					ЕСли  НайденоСвойство и ДопРеквизит.Исключить ТОгда
						ИспользоватьЭтоПравило=Ложь;
						Прервать;
					ИначеЕсли НЕ НайденоСвойство и НЕ  ДопРеквизит.Исключить ТОгда
						ИспользоватьЭтоПравило=Ложь; 
						Прервать;				
					КонецЕсли;				
				КонецЕсли;
			КонецЦикла; 
		КонецЕсли;
		
		Если ИспользоватьЭтоПравило Тогда
			Возврат Истина;
		КонецЕсли;			
		
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции

Процедура УстановитьЗначениеПараметраНастроек(Настройки, ИмяПараметра, Значение)
	
	Параметр = Настройки.ПараметрыДанных.Элементы.Найти(ИмяПараметра);
	
	Если Параметр <> Неопределено Тогда
		Параметр.Значение = Значение;
		Параметр.Использование = Истина;
	КонецЕсли;
	
КонецПроцедуры

Функция ИспользоватьПравилоСКД(Выборка,Номенклатура,ПоНоменклатуре) Экспорт  //+Лико m.shenderov 30.12.2018
	ОтборНастройки= Новый КомпоновщикНастроекКомпоновкиДанных;
    СхемаКомпоновкиДанных = Справочники.Лико_КонтрольПартийПоризводстваНоменклатуры.ПолучитьМакет("ОтборПоУсловию");
	//URLСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор());
   ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных);
   ОтборНастройки.Инициализировать(ИсточникНастроек);
   	ТекНастройки = Выборка.ОтборНастройки.Получить();
	
	Если ТекНастройки = Неопределено Тогда
		ОтборНастройки.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Иначе
		ОтборНастройки.ЗагрузитьНастройки(ТекНастройки);
	КонецЕсли;
	//ОтборНастройки.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
    УстановитьЗначениеПараметраНастроек(ОтборНастройки.Настройки, "Номенклатура"  , Номенклатура);
	УстановитьЗначениеПараметраНастроек(ОтборНастройки.Настройки, "ПоНоменклатуре", ПоНоменклатуре);

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, ОтборНастройки.ПолучитьНастройки(),,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	Если Не ПоНоменклатуре Тогда
		Возврат ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных).ВыгрузитьКолонку("Номенклатура");
	КонецЕсли;
	
	Если 	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных).Количество()>0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли; 	
КонецФункции //-Лико m.shenderov 30.12.2018 

Функция ТекстЗапросаПравилПоВидуНоменклатуры()
	
	Возврат 
	"ВЫБРАТЬ
	|	Лико_КонтрольПартийПоризводстваНоменклатуры.Ссылка КАК Ссылка,
	|	Лико_КонтрольПартийПоризводстваНоменклатуры.ВерсияДанных КАК ВерсияДанных,
	|	Лико_КонтрольПартийПоризводстваНоменклатуры.ПометкаУдаления КАК ПометкаУдаления,
	|	Лико_КонтрольПартийПоризводстваНоменклатуры.Код КАК Код,
	|	Лико_КонтрольПартийПоризводстваНоменклатуры.Наименование КАК Наименование,
	|	Лико_КонтрольПартийПоризводстваНоменклатуры.Выключить КАК Выключить,
	|	Лико_КонтрольПартийПоризводстваНоменклатуры.Организация КАК Организация,
	|	Лико_КонтрольПартийПоризводстваНоменклатуры.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Лико_КонтрольПартийПоризводстваНоменклатуры.Описание КАК Описание,
	|	Лико_КонтрольПартийПоризводстваНоменклатуры.Предопределенный КАК Предопределенный,
	|	Лико_КонтрольПартийПоризводстваНоменклатуры.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
	|	Лико_КонтрольПартийПоризводстваНоменклатуры.СложнаяНастройка КАК СложнаяНастройка,
	|	Лико_КонтрольПартийПоризводстваНоменклатуры.ОтборНастройки КАК ОтборНастройки,
	|	Лико_КонтрольПартийПоризводстваНоменклатуры.Приоритет КАК Приоритет
	|ИЗ
	|	Справочник.Лико_КонтрольПартийПоризводстваНоменклатуры КАК Лико_КонтрольПартийПоризводстваНоменклатуры
	|ГДЕ
	|	Лико_КонтрольПартийПоризводстваНоменклатуры.ВидНоменклатуры = &ВидНоменклатуры
	|	И НЕ Лико_КонтрольПартийПоризводстваНоменклатуры.ПометкаУдаления
	|	И НЕ Лико_КонтрольПартийПоризводстваНоменклатуры.Выключить
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	
КонецФункции

Функция ОпределитьПравило(Номенклатура) Экспорт
   УстановитьПривилегированныйРежим(Истина);
		
	Запрос = Новый Запрос;
	Запрос.Текст=ТекстЗапросаПравилПоВидуНоменклатуры(); 
	Запрос.УстановитьПараметр("ВидНоменклатуры",Номенклатура.ВидНоменклатуры );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл 		
		ИспользоватьЭтоПравило=Истина;	
		Если Выборка.СложнаяНастройка Тогда 
		ИспользоватьЭтоПравило= ИспользоватьПравилоСКД(Выборка,Номенклатура,Истина);		
			
		Иначе
			Для каждого ДопРеквизит Из Выборка.Ссылка.ДополнительныеРеквизиты Цикл			
				Если ЗначениеЗаполнено(ДопРеквизит.Значение) ТОгда
					Структура = Новый Структура;
					Структура.Вставить("Свойство",ДопРеквизит.Свойство);
					Структура.Вставить("Значение",ДопРеквизит.Значение);
					НайденоСвойство=Номенклатура.ДополнительныеРеквизиты.НайтиСтроки(Структура).Количество()>0;
					ЕСли  НайденоСвойство и ДопРеквизит.Исключить ТОгда
						ИспользоватьЭтоПравило=Ложь;
						Прервать;
					ИначеЕсли НЕ НайденоСвойство и НЕ  ДопРеквизит.Исключить ТОгда
						ИспользоватьЭтоПравило=Ложь; 
						Прервать;				
					КонецЕсли;				
				КонецЕсли;
			КонецЦикла; 
		КонецЕсли;
		
		Если ИспользоватьЭтоПравило Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;			
		
	КонецЦикла;
	

КонецФункции

Функция ПолучитьПриоритетМакс(ВидНоменклатуры) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(Лико_КонтрольПартийПоризводстваНоменклатуры.Приоритет) КАК Приоритет
	|ИЗ
	|	Справочник.Лико_КонтрольПартийПоризводстваНоменклатуры КАК Лико_КонтрольПартийПоризводстваНоменклатуры
	|ГДЕ
	|	Лико_КонтрольПартийПоризводстваНоменклатуры.ВидНоменклатуры = &ВидНоменклатуры";
	Запрос.УстановитьПараметр("ВидНоменклатуры",ВидНоменклатуры );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Возврат ?(ЗначениеЗаполнено(Выборка.Приоритет),Выборка.Приоритет,0);
		
	КонецЦикла; 
	
	Возврат 0;	
КонецФункции //-Лико m.shenderov 28.12.2018 

Процедура ПереместитьПоПриоритету(Ссылка,Шаг) Экспорт 
	
	
	ТекущийПриоритет	=	Ссылка.Приоритет;
	НовыйПриоритет		=	ТекущийПриоритет+Шаг;
	
	Если НовыйПриоритет=0 Или НовыйПриоритет=ПолучитьПриоритетМакс(Ссылка.ВидНоменклатуры)+1 Тогда
		Возврат;
	КонецЕсли;
	
	ПравилоКонкурент=ПолучитьПравилоПоПриоритету(Ссылка.ВидНоменклатуры,НовыйПриоритет);
	
	НачатьТранзакцию();
	
	СправочникОбъект			=Ссылка.ПолучитьОбъект();
	СправочникОбъект.Приоритет	=НовыйПриоритет; 	
	СправочникОбъект.Записать();
	Если ЗначениеЗаполнено(ПравилоКонкурент) Тогда
		
		СправочникОбъект			 =ПравилоКонкурент.ПолучитьОбъект();
		СправочникОбъект.Приоритет	 =СправочникОбъект.Приоритет-Шаг; 	
		СправочникОбъект.Записать();
	КонецЕсли;
	
	
	
	
	ЗафиксироватьТранзакцию();
	
	
	
КонецПроцедуры //-Лико m.shenderov 28.12.2018

Функция ПолучитьПравилоПоПриоритету(ВидНоменклатуры,Приоритет) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_КонтрольПартийПоризводстваНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Лико_КонтрольПартийПоризводстваНоменклатуры КАК Лико_КонтрольПартийПоризводстваНоменклатуры
	|ГДЕ
	|	Лико_КонтрольПартийПоризводстваНоменклатуры.ВидНоменклатуры = &ВидНоменклатуры
	|	И Лико_КонтрольПартийПоризводстваНоменклатуры.Приоритет = &Приоритет";
	Запрос.УстановитьПараметр("ВидНоменклатуры",ВидНоменклатуры);
	Запрос.УстановитьПараметр("Приоритет",Приоритет);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Возврат Выборка.Ссылка;	
		
	КонецЦикла; 
	
	
КонецФункции //-Лико m.shenderov 29.12.2018 

Функция СформироватьИмяПартии(Номенклатура,Серия,ПрослеживаемостьТоваров) Экспорт  //+Лико m.shenderov 27.03.2023
	Имя="Не требуется";
	Если ПрослеживаемостьТоваров Тогда 
		ОН=Серия.ЯССМ_ОбъектНоменклатуры;
		
		Если  Номенклатура.Лико_КонтрольПартииПроизводстваТовара Или Не ОН.Уникальный  Тогда 
			Если Не ОН.ЕстьПартияПроизводства И РегистрыСведений.Лико_ПартииПроизводства.ПартияНаследуется(Серия) Тогда 
				Имя="Наследуется";
			Иначе
				Имя=СтрШаблон("%1; %2 ; %3",
				?(ЗначениеЗаполнено(ОН.ПричинаОтсутствияНомераПартииИзготовления),ОН.ПричинаОтсутствияНомераПартииИзготовления,ОН.НомерПартииИзготовления),
				?(ЗначениеЗаполнено(ОН.ПричинаОтсутствияДатыИзготовления),ОН.ПричинаОтсутствияДатыИзготовления,?(ЗначениеЗаполнено(ОН.ДатаПроизводства),Формат(ОН.ДатаПроизводства,"ДЛФ=D"),"")),
				?(ЗначениеЗаполнено(ОН.УпотребитьДо),Формат(ОН.УпотребитьДо,"ДЛФ=D"),""));
			КонецЕсли;
		Иначе
			Имя="Не требуется";
		КонецЕсли;
	КонецЕсли;
	
	Возврат  Имя;	
КонецФункции  //-Лико m.shenderov 27.03.2023

Функция ТребоватьПартию(ОбъектНоменклатуры) Экспорт  //+Лико m.shenderov 30.03.2023

	
	Если ОбъектНоменклатуры.Номенклатура.Лико_КонтрольПартииПроизводстваТовара И  
		Не ЕстьПартияПроизводства(ОбъектНоменклатуры) И
		Не РегистрыСведений.Лико_ПартииПроизводства.ПартияНаследуется(ОбъектНоменклатуры.Серия) Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
	
	
	
	
КонецФункции //-Лико m.shenderov 30.03.2023 

Функция ЕстьПартияПроизводства(ОбъектНоменклатуры) Экспорт  //+Лико m.shenderov 30.03.2023
	
	Если (ЗначениеЗаполнено(ОбъектНоменклатуры.НомерПартииИзготовления) Или ЗначениеЗаполнено(ОбъектНоменклатуры.ПричинаОтсутствияНомераПартииИзготовления)) И 
		(ЗначениеЗаполнено(ОбъектНоменклатуры.ДатаПроизводства) Или ЗначениеЗаполнено(ОбъектНоменклатуры.ПричинаОтсутствияДатыИзготовления)) Тогда
		ЕстьПартияПроизводства=Истина;
	Иначе
		ЕстьПартияПроизводства=Ложь;
	КонецЕсли;
	 Возврат   ЕстьПартияПроизводства;
КонецФункции //-Лико m.shenderov 30.03.2023
